# ReverseIterator Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GroundConductorSizeSet..::..ReverseIterator Method
GroundConductorSizeSet Class See Also
---
Retrieve a backward moving iterator to the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual GroundConductorSizeSetIterator ReverseIterator()
```

Visual Basic
---
```text
Public Overridable Function ReverseIterator As GroundConductorSizeSetIterator
```

Visual C++
---
```text
public:
virtual GroundConductorSizeSetIterator^ ReverseIterator()
```

# ### Return Value
Returns a backward moving iterator to the set.
# See Also
GroundConductorSizeSet Class
Autodesk.Revit.DB.Electrical Namespace